000100 EXEC SQL
000200   SELECT COUNT(*) INTO :WS-COUNT
000300   FROM STUDENTS
000400   WHERE AGE > 42
000500 END-EXEC
000600 IF WS-COUNT > 0 THEN
000700   DISPLAY "We have matching elements."
000800 END-IF.
