000100 EXEC SQL
000200   SELECT 1
000300   FROM STUDENTS
000400   WHERE AGE > 42
000500 END-EXEC
000600 IF SQLCODE >= 0 AND SQLCODE <> +100 THEN
000700   DISPLAY "We have matching elements."
000800 END-IF.
