000100 LINKAGE SECTION.
------
001000 01 MY-PCB.
001100    05 DBD-NAME     PIC X(8).
001200    05 SEG-LEVEL    PIC XX.
001300    05 STATUS-CODE  PIC XX.
001400    05 PROC-OPT     PIC XXXX.
001500    05 FILLER       PIC S9(5) COMP-5.
001600    05 SEG-NAME     PIC X(8).
001700    05 LEN-KFB      PIC S9(5) COMP-5
001800    05 NU-SENSEG    PIC S9(5) COMP-5
001900    05 KEY-FB       PIC X(256).
------
002000 PROCEDURE DIVISION.
------
003100 CALL 'CBLTDLI' USING DL1-FUNC MY-PCB SEGM.
003200 PERFORM MORE-BUSINESS-LOGIC.
