000100 CALC-A.
000200   MULTIPLY INVOICE-HOURS-A BY HOURLY-RATE-A GIVING TOTAL.
000300   IF TOTAL LESS THAN 10,000 OR AUTHORISATION NOT EQUAL ZERO THEN
000400     PERFORM PAY-INVOICE-A
000500   ELSE
000600     PERFORM AUTHORISATION-NEEDED
000700   END-IF.
000800 
000900 CALC-B.
001000   MULTIPLY INVOICE-HOURS-B BY HOURLY-RATE-B GIVING TOTAL.
001100   IF TOTAL LESS THAN 10,000 OR AUTHORISATION NOT EQUAL ZERO THEN
001200     PERFORM PAY-INVOICE-B
001300   ELSE
001400     PERFORM AUTHORISATION-NEEDED
001500   END-IF.
