000100  IF A IS EQUAL TO 1 THEN
000200    ALTER B TO D
000300  END-IF.
000400 
000500  B.
000600 
000700  GO TO C.
000800 
000900  C.
001000 
001100  DISPLAY "A = 1"
001200 
001300  D.
001400 
001500  DISPLAY "A != 1".
