000100 01  DISPLAY-ITEM    PIC 99.99    DISPLAY.
000150 01  CONVERTED-ITEM  PIC 99V999   BINARY.
000200 01  BINARY-ITEM     PIC 99V999   BINARY.
------
000950 MOVE DISPLAY-ITEM TO CONVERTED-ITEM.
001000 ADD CONVERTED-ITEM TO BINARY-ITEM.