000100 PERFORM FIND-OPEN-INVOICES THROUGH FINALIZE-PAYMENTS.
------* ...
002000 LOAD-INVOICES.       *> ...
002100 FIND-OPEN-INVOICES.  *> ...
002200 PREPARE-PAYMENTS.    *> ...
002300 FINALIZE-PAYMENTS.   *> ...
002400 CLOSE-INVOICES.      *> ...
