000100 PERFORM PAYMENT-PROCESSING.
------* ...
001000 PAYMENT-PROCESSING.
001100   PERFORM FIND-OPEN-INVOICES.
001200   PERFORM PREPARE-PAYMENTS.
001300   PERFORM FINALIZE-PAYMENTS.
------* ...
002000 LOAD-INVOICES.       *> ...
002100 FIND-OPEN-INVOICES.  *> ...
002200 PREPARE-PAYMENTS.    *> ...
002300 FINALIZE-PAYMENTS.   *> ...
002400 CLOSE-INVOICES.      *> ...
