000100 ENVIRONMENT DIVISION.
000200 INPUT-OUTPUT SECTION.
000300 FILE-CONTROL.
000400   SELECT SORT1 ASSIGN TO SORTFILE.
000500   SELECT FILE1 ASSIGN TO INFILE.
000600   SELECT FILE2 ASSIGN TO OUTFILE.
000700 
000800 DATA DIVISION.
000900 FILE SECTION.
001000   FD  FILE1
001100       BLOCK CONTAINS 10 RECORDS.
001200   FD  FILE2
001300       BLOCK CONTAINS 10 RECORDS.
001400 
001500   SD  SORT1
001600       RECORD CONTAINS 3 CHARACTERS
001700       DATA RECORD IS S1.
001800   01  S1.
001900       02 S1-KEYS.
002000           03  S1-1 PICTURE XXX.
002100 
002200 PROCEDURE DIVISION.
002300   SORT SORT1    
002400       ON ASCENDING KEY S1-1
002500       USING FILE1          
002600       GIVING FILE2.        
