000100 1 REC-A.
000200   02 AMOUNT1    PIC S9(5) COMP-3.
000300   02 AMOUNT2    PIC S9(7) COMP-3.
000400 
000500 1 REC-B.
000600   02 AMOUNT1    PIC S9(5) COMP-3.
000700   02 AMOUNT2    PIC S9(7) COMP-3.
000800 
000900 1 REC-C.
001000   02 AMOUNT-ONE    PIC S9(5) COMP-3.
001100   02 AMOUNT-TWO    PIC S9(7) COMP-3.
