//MYJOB     JOB 1
//MYSORT    EXEC PGM=DFSORT
//SORTIN    DD DISP=SHR,DSN=ZPROF.AREA.CODES
//SORTOUT   DD DSN=OUT1
//SYSOUT    DD SYSOUT=*
//SYSIN     DD *
SORT FIELDS=(1,3,CH,A)
/*
