002100 IF SOME-CONDITION THEN
002200    CALL "CREDIT" USING AMOUNT RETURNING BALANCE
002300 ELSE
002400    CALL "DEBIT"  USING AMOUNT RETURNING BALANCE
002500 END-IF.
