000100 PERFORM VARYING I FROM 1 BY 1 UNTIL I >= 10
------*  ...
000200   IF MY-DATA(I) = 0
000300      SUBTRACT 2 FROM I
000400   END-IF
------*  ...
000500 END-PERFORM.
