000100 PERFORM UNTIL I >= 10
------*  ...
000200   IF MY-DATA(I) = 0
000300      SUBTRACT 2 FROM I
000400   ELSE
000500      ADD 1 TO I
000600   END-IF
------*  ...
000700 END-PERFORM.
