000100 EVALUATE N ALSO X GREATER THAN Y
000200 WHEN 1 ALSO TRUE
000300     DISPLAY "A"
000400 WHEN 1 ALSO FALSE
000500     DISPLAY "B"
000600 WHEN 2 ALSO ANY
000700   PERFORM C.
