000100 EVALUATE N
000200 WHEN 1
000300   IF X GREATER THAN Y
000400     DISPLAY "A"
000500   ELSE
000600     DISPLAY "B"
000700 WHEN 2
000800   PERFORM C.
