001100 ENVIRONMENT DIVISION.
001200 INPUT-OUTPUT SECTION.
001300 FILE-CONTROL.
001400
001500   SELECT FILE-WITH-STATUS
001600     ASSIGN TO A
001700     FILE STATUS IS MY-FILE-STATUS.
------* ...
002100 PROCEDURE DIVISION.
002200
002300 SORT FILE-WITH-STATUS ON ASCENDING F 
002400   USING X Y 
002500   GIVING Z.
002600 IF MY-FILE-STATUS <> "00" THEN
002700   PERFORM ERROR-HANDLING-ROUTINE.
