001100 ENVIRONMENT DIVISION.
001200 INPUT-OUTPUT SECTION.
001300 FILE-CONTROL.
001400
001500   SELECT FILE-WITH-STATUS
001600     ASSIGN TO A
001700     FILE STATUS IS MY-FILE-STATUS.
------* ...
002100 PROCEDURE DIVISION.
002200
002300 CLOSE FILE-WITH-STATUS.
