000100 DATA DIVISION.
000200 WORKING-STORAGE SECTION.
000300 01  GROUP-SIZE-83.
000400   03  WS-RIGHT-1-20                PIC X(20).
000500   03  WS-RIGHT-21-40               PIC X(20).
000600   03  WS-RIGHT-41-60               PIC X(20).
000700   03  WS-RIGHT-61-80               PIC X(20).
000800   03  WS-RIGHT-81-83               PIC X(3). 
000900 
001000 01  TEMP-STORAGE PIC X(7).
001100 
001200 PROCEDURE DIVISION.
001300 ONE SECTION.
001400 A.
001500   MOVE WS-RIGHT-21-40 TO TEMP-STORAGE.
