000100 DATA DIVISION.
000200 WORKING-STORAGE SECTION.
000300 01  ALPHANUMERIC-ITEM PIC X(20).
000400 
000500 01  NUMERIC-ITEM PIC 9(20).
000600 
000700 PROCEDURE DIVISION.
000800 ONE SECTION.
000900 A.
001000   MOVE ALPHANUMERIC-ITEM TO NUMERIC-ITEM.
