000100 PERFORM UNTIL AT-END-OF-FILE
000200   READ MY-FILE INTO DATA
000300     AT END 
000400       SET AT-END-OF-FILE TO TRUE
000500     NOT AT END
000600       MOVE DATA TO MY-ARRAY (THE-INDEX)
000700       ADD +1    TO THE-INDEX
000800   END-READ
000900 END-PERFORM.