000100 ID DIVISION.
000200 PROGRAM-ID. TOP-LEVEL.
000300 PROCEDURE DIVISION.
000400   CALL "SUBPROGRAM"
000500   DISPLAY "SUBPROGRAM EXECUTION COMPLETE."
000600   GOBACK.
000700 
000800 ID DIVISION.
000900 PROGRAM-ID. SUBPROGRAM.
001000   DISPLAY "SUBPROGRAM EXECUTION STARTED."
001100   GOBACK.
001200 END PROGRAM SUBPROGRAM.
001300
001400 END PROGRAM TOP-LEVEL.

