000100 MOVE 0 TO I.
000200 ONE-TO-TEN.
000300   ADD 1 TO I.
000400   DISPLAY I.
000500   IF I < 10 THEN
000600     GO TO ONE-TO-TEN.
000700   DISPLAY "Done."
