000100 EVALUATE N
000200   WHEN 1 DISPLAY "1"
000300   WHEN 2 PERFORM C
000400   WHEN 3 GOBACK
000500   WHEN OTHER PERFORM Z-ABEND
000600 END-EVALUATE.
