000100 DATA DIVISION.
000200
000300 WORKING-STORAGE SECTION.
000400
000500 01  NUMERIC-01  PIC 999  VALUE  "N/A".
000600
000700 PROCEDURE DIVISION.
000800
...