000100 DATA DIVISION.
000200 
000300 LINKAGE SECTION.
000400 
000500 01  INPUT-01    VALUE  "A".
000600
000700 01  INPUT-02    PIC X.
000800   88  RED    VALUE  "R".
000900   88  GREEN    VALUE  "G".
001000   88  BLUE    VALUE  "B".
001100
001200 WORKING-STORAGE SECTION.
001300
001400 01  VALUE-01    VALUE  "Z".
001500
001600 PROCEDURE DIVISION.
001700
...