000100 DATA DIVISION.
000200 WORKING-STORAGE SECTION.
000300 
000400 LINEX          PIC 999.
000500 SCREEN-LINE    PIC X(300) OCCURS 50 TIMES.
000600 
000700 
000800 PROCEDURE DIVISION.
000900 
001000 PERFORM VARYING LINEX FROM 1 BY 1
001100     UNTIL LINEX > 50
001200     MOVE SPACES TO SCREEN-LINE(LINEX)
001300 END-PERFORM.