000100 RECOVERY SECTION.
000200 
000300 100-ENTRY.
000400   MOVE CURRENT-STATUS TO RETURN-CODE.
000500   WRITE LOG-FILE FROM PROGRESS-RECORD.
000600   GOBACK.
000700 
000800 999-EXIT.
000900   EXIT.
