000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BUSINESS-LOGIC.
000300 DATA DIVISION.
------* Shared data definition, including BALANCE and CUSTOMER RATING.
001000 PROCEDURE DIVISION.
001100 IF BALANCE < 0
001200    SUBTRACT 1 FROM CUSTOMER-RATING.
