000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 BALANCE          PIC S9(9).
000600 01 CUSTOMER-RATING  PIC S9(9).
001000 PROCEDURE DIVISION.
001100 IF BALANCE < 0
001200    SUBTRACT 1 FROM CUSTOMER-RATING.
001300 DISPLAY CUSTOMER-RATING.
