000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. BUSINESS-LOGIC.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
------ COPY ENTRIES.
001000 PROCEDURE DIVISION.
------ COPY LOGIC.
001300 DISPLAY CUSTOMER-RATING.
