000100 IF Num1 < 10
000200   ADD 10 TO Num1
000300   MULTIPLY Num1 BY 1000 GIVING NUM2
000400     ON SIZE ERROR  DISPLAY "Error: Num2 too small"
000500   END-MULTIPLY
000600 END-IF
000700   DISPLAY "When is this shown?"
000800 .
