000100 EXEC CICS
000200      RECEIVE MAP('MENMAP1')
000300              MAPSET('MENSET1')
000400              INTO(MENMAP1I)
000450              RESP(XXX)
000500 END-EXEC
000600 IF XXX <> DFHRESP(NORMAL) THEN
------* ...
000700 END-IF.